src/InformationRegisters/ПроцессыДляЗапуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ПроцессыДляЗапуска</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОтложенногоСтарта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияПроцессовДляЗапуска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаОтменыСтарта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтложенныйБизнесПроцесс</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СостоянияПроцессовДляЗапуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>СостоянияПроцессовДляЗапуска</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГотовКСтарту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтартОтменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/ПроцессыДляЗапуска/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Добавляет сведения об успешном старте процесса.
//
// Параметры:
//   - БизнесПроцесс - БизнесПроцессСсылка.
//
Процедура ЗарегистрироватьСтартПроцесса(Процесс) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.БизнесПроцесс = Процесс;
	Запись.Прочитать();
	
	Если Не Запись.Выбран() Тогда
		Возврат;
	КонецЕсли;
	
	Запись.Удалить();
	
КонецПроцедуры

// Добавляет сведения об отмене старта процесса.
//
// Параметры:
//   - БизнесПроцесс - БизнесПроцессСсылка.
//
Процедура ЗарегистрироватьОтменуСтарта(Процесс, ПричинаОтмены) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.БизнесПроцесс = Процесс;
	Запись.Прочитать();
	
	Если Не Запись.Выбран() Тогда
		Возврат;
	КонецЕсли;
	
	Запись.Состояние = Перечисления.СостоянияПроцессовДляЗапуска.СтартОтменен;
	Запись.ПричинаОтменыСтарта = ПричинаОтмены;
	
	Запись.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
